## Plans :thumbsup:
<details>
  <summary><h2>Terrateam Plan Output :thumbsup:</h2></summary>


**Dir**: digitalocean
**Workspace**: default
**Success**: :thumbsup:

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # kubernetes_manifest.argocd-gateway will be created
+   resource "kubernetes_manifest" "argocd-gateway" {
+       manifest = {
+           apiVersion = "networking.istio.io/v1beta1"
+           kind       = "Gateway"
+           metadata   = {
+               name      = "argocd"
+               namespace = "argocd"
            }
+           spec       = {
+               selector = {
+                   istio = "ingressgateway"
                }
+               servers  = [
+                   {
+                       hosts = [
+                           "argocd.wayofthesys.org",
                        ]
+                       port  = {
+                           name     = "https"
+                           number   = 443
+                           protocol = "HTTPS"
                        }
+                       tls   = {
+                           credentialName = "argocd-secret"
+                           httpsRedirect  = false
+                           mode           = "SIMPLE"
                        }
                    },
                ]
            }
        }
+       object   = {
+           apiVersion = "networking.istio.io/v1beta1"
+           kind       = "Gateway"
+           metadata   = {
+               annotations                = (known after apply)
+               clusterName                = (known after apply)
+               creationTimestamp          = (known after apply)
+               deletionGracePeriodSeconds = (known after apply)
+               deletionTimestamp          = (known after apply)
+               finalizers                 = (known after apply)
+               generateName               = (known after apply)
+               generation                 = (known after apply)
+               labels                     = (known after apply)
+               managedFields              = (known after apply)
+               name                       = "argocd"
+               namespace                  = "argocd"
+               ownerReferences            = (known after apply)
+               resourceVersion            = (known after apply)
+               selfLink                   = (known after apply)
+               uid                        = (known after apply)
            }
+           spec       = {
+               selector = {
+                   "istio" = "ingressgateway"
                }
+               servers  = [
+                   {
+                       bind            = (known after apply)
+                       defaultEndpoint = (known after apply)
+                       hosts           = [
+                           "argocd.wayofthesys.org",
                        ]
+                       name            = (known after apply)
+                       port            = {
+                           name       = "https"
+                           number     = 443
+                           protocol   = "HTTPS"
+                           targetPort = (known after apply)
                        }
+                       tls             = {
+                           caCertificates        = (known after apply)
+                           cipherSuites          = (known after apply)
+                           credentialName        = "argocd-secret"
+                           httpsRedirect         = false
+                           maxProtocolVersion    = (known after apply)
+                           minProtocolVersion    = (known after apply)
+                           mode                  = "SIMPLE"
+                           privateKey            = (known after apply)
+                           serverCertificate     = (known after apply)
+                           subjectAltNames       = (known after apply)
+                           verifyCertificateHash = (known after apply)
+                           verifyCertificateSpki = (known after apply)
                        }
                    },
                ]
            }
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

```

<details>
  <summary>To apply this directory and workspace...</summary>

```
terrateam apply dir:digitalocean workspace:default
```

</details>


</details>

To apply all these changes, comment:

```
terrateam apply
```

## Cost Estimation
**Total Monthly Difference: 0.00 USD**
<details>
  <summary>Expand for cost estimation details</summary>

| Dir | Workspace | Previous (USD) | New (USD) | Diff (USD) |
| :---: | :---: | ---: | ---: | ---: |
| digitalocean | default | 0.00 | 0.00 | 0.00|
| | **Total** | **0.00** | **0.00** | **0.00** |
</details>

---

<details>
  <summary><h3>Feedback?</h3></summary>

Questions? Comments? Give feedback by commenting `terrateam feedback <your msg>`.  Your message lands directly in our inbox.

</details>
